ТСД_файловая/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПокупки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженПриОбмене</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.СтатусыЗаказовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.АдресДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>РеглУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>EnumRef.ТипыОплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТСД_файловая/src/Enums/СтатусыЗаказовКлиентов/СтатусыЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовКлиентов</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОбмену</name>
  </enumValues>
  <enumValues>
    <name>Архивный</name>
  </enumValues>
</mdclass:Enum>

ТСД_файловая/src/Documents/ЗаказКлиента/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекстЗаголовка = НСтр("ru = '%ПредставлениеНомера% от %ПредставлениеДата%'");
	
	ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ПредставлениеНомера%", 
		ОбщегоНазначенияКлиентСервер.ПредставлениеНомера(Данные.Ссылка.Номер));
		
	ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ПредставлениеДата%",
		Формат(Данные.Ссылка.Дата,"ДФ=dd.MM; ДЛФ=D"));
	
	Представление = ТекстЗаголовка;
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список чеков, которые содержат переданную номенклатуру
// 
// Возвращаемое значение:
//   Массив   - пустой массив, если чеков с номенклатурой нет.
//
Функция СписокДокументовСодержащихНоменклатуру(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивЧеков = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивЧеков;
	
КонецФункции

// Возвращает список чеков, которые содержат переданную номенклатуру
// 
// Возвращаемое значение:
//   Массив   - пустой массив, если чеков с номенклатурой нет.
//
Функция ПолучитьЧекПоЗаказуКлиента(Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Чек.Ссылка
		|ИЗ
		|	Документ.Чек КАК Чек
		|ГДЕ
		|	Чек.ЗаказКлиента = &ЗаказКлиента
		|	И Чек.СтатусЧека <> ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Аннулирован)";
		
	Запрос.УстановитьПараметр("ЗаказКлиента", Заказ);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСостояниеЗаказовНаСегодня() Экспорт
	//
	//Дата = ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату();
	//
	//Результат = Новый Структура;
	//Результат.Вставить("НеСогласовано", 0);
	//Результат.Вставить("Согласовано", 0);
	//Результат.Вставить("Выполнено", 0);
	//Результат.Вставить("Отменено", 0);
	//
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК НеСогласовано,
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Согласован)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК Согласовано,
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Выполнен)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК Выполнено,
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Отменен)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК Отменено
	//|ПОМЕСТИТЬ Т
	//|ИЗ
	//|	Документ.ЗаказКлиента КАК ЗаказКлиента
	//|ГДЕ
	//|	ЗаказКлиента.ЖелаемаяДатаПокупки МЕЖДУ &ДатаС И &ДатаПо
	//|	И ЗаказКлиента.Проведен
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Согласован)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Выполнен)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Отменен)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ
	//|ИЗ
	//|	Документ.ЗаказКлиента КАК ЗаказКлиента
	//|ГДЕ
	//|	ЗаказКлиента.ЖелаемаяДатаПокупки < &ДатаС
	//|	И ЗаказКлиента.Проведен
	//|	И ЗаказКлиента.СтатусЗаказа В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован), ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Согласован))
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(СУММА(Т.НеСогласовано), 0) КАК НеСогласовано,
	//|	ЕСТЬNULL(СУММА(Т.Согласовано), 0) КАК Согласовано,
	//|	ЕСТЬNULL(СУММА(Т.Выполнено), 0) КАК Выполнено,
	//|	ЕСТЬNULL(СУММА(Т.Отменено), 0) КАК Отменено
	//|ИЗ
	//|	Т КАК Т";
	//
	//Запрос.УстановитьПараметр("ДатаС",  НачалоДня(Дата));
	//Запрос.УстановитьПараметр("ДатаПо", КонецДня(Дата));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Если Выборка.Следующий() Тогда
	//	
	//	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	//	
	//КонецЕсли;
	//
	//Возврат Результат;
	//
КонецФункции

Функция ПолучитьСостояниеЗаказовНаЗавтра() Экспорт
	//
	//Дата = ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату() + 86400;
	//
	//Результат = Новый Структура;
	//Результат.Вставить("НеСогласовано", 0);
	//Результат.Вставить("Согласовано", 0);
	//Результат.Вставить("Выполнено", 0);
	//Результат.Вставить("Отменено", 0);
	//
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	//|					ТОГДА 1
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК НеСогласовано,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Согласован)
	//|					ТОГДА 1
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК Согласовано,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Выполнен)
	//|					ТОГДА 1
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК Выполнено,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Отменен)
	//|					ТОГДА 1
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК Отменено
	//|ИЗ
	//|	Документ.ЗаказКлиента КАК ЗаказКлиента
	//|ГДЕ
	//|	ЗаказКлиента.ЖелаемаяДатаПокупки МЕЖДУ &ДатаС И &ДатаПо
	//|	И ЗаказКлиента.Проведен";
	//
	//Запрос.УстановитьПараметр("ДатаС",  НачалоДня(Дата));
	//Запрос.УстановитьПараметр("ДатаПо", КонецДня(Дата));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Если Выборка.Следующий() Тогда
	//	
	//	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	//	
	//КонецЕсли;
	//
	//Возврат Результат;
	
КонецФункции


Функция ЗаказыКВыгрузке() Экспорт
	
	МассивДокументов = Новый Массив;
	
	Если НЕ ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим() Тогда
		
		Возврат МассивДокументов;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Проведен
	|	И ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.ГотовКОбмену)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивДокументов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивДокументов;
	
КонецФункции



#КонецОбласти

#КонецЕсли
